refactor(readme): 使用 mermaid 更新架构图，增强可读性
